Repository: NgocDM123/Direction-project2
Catalog: lib/l10n/app_*.arb
Languages: th, vi

# tab1
source: Welcome
th: ยินดีต้อนรับ
vi: Xin chào

# tab2
source: Settings
th: การตั้งค่า
vi: Cài đặt

# tab3
source: Advice
th: คำแนะนำ
vi: Lời khuyên

source: Simulation Results
th: ผลการจำลอง
vi: Kết quả mô phỏng

# welcomeMessage
source: Welcome to the Cassava Irrigation App
th: ยินดีต้อนรับสู่แอพพลิเคชั่นการให้น้ำของมันสำปะหลัง
vi: Chào mừng đến với ứng dụng tưới tiêu cho cây sắn

# instructionMessage
source: Please swipe left to get started. The middle tab allows you to enter data and the right tab shows simulation results
th: โปรดเลื่อนไปทางซ้ายมือเพื่อเริ่มต้น คุณสามารถป้อนข้อมูลได้ที่แท็บตรงกลาง ผลการจำลองจะแสดงที่แท็บด้านขวามือ
vi: Vui lòng lướt sang trái để bắt đầu Cửa sổ ở giữa sẽ cho phép bạn nhập dữ liệu Cửa sổ bên phải sẽ hiển thị kết quả mô phỏng

# disclaimerMessage
source: Disclaimer: This app cannot be trusted in any way. Do not use it. The makers do not take any responsibility for anything.
th: การปฏิเสธความรับผิด: แอพพลิเคชั่นนี้ยังไม่สามารถนำไปใช้งานได้จริง ผู้ผลิตจะไม่รับผิดต่อความเสียหายใด ๆ ทั้งสิ้น
vi: Cảnh báo: Ứng dụng là sự tham khảo tương đối, không nên quá tin tưởng vào nó.

source: {fieldName} dismissed
th: {fieldName} แปลงปลูกที่ถูกลบทิ้ง
vi: {fieldName} đã loại bỏ

source: Edit {fieldName}
th: แก้ไข {fieldName}
vi: Chỉnh sửa {fieldName}

# hintFieldName
source: myCassavaField
th: ไร่มันสำปะหลังของฉัน
vi: Nhập tên cánh đồng

# pleaseEnterUniqueFieldName
source: Please enter a unique field name
th: โปรดป้อนชื่อแปลงปลูก
vi: Vui lòng nhập một tên cánh đồng duy nhất

source: Adding field
th: กำลังเพิ่มชื่อแปลงปลูก
vi: Đang thêm thông tin cánh đồng

source: Cancel
th: ยกเลิก
vi: Hủy

source: Submit
th: ส่ง
vi: Ok

source: Error
th: ข้อผิดพลาด
vi: Lỗi

source: Too many fields!
th: จำนวนแปลงปลูกมากเกินไป
vi: Quá nhiều cánh đồng

# pleaseRemoveField
source: Please remove a field before adding a new one
th: โปรดลบชื่อแปลงปลูกเดิมก่อนเพิ่มชื่อแปลงปลูกใหม่
vi: Vui lòng xóa cánh đồng

# returnMsg
source: Return
th: ส่งกลับ

source: Field name
th: ชื่อแปลงปลูก
vi: Tên cánh đồng

source: Field color
th: เลือกสีสำหรับแปลงปลูก
vi: Màu sắc cánh đồng

# pleaseAddField
source: Please add, at least, one field in the previous tab
th: โปรดเพิ่มชื่อแปลงปลูกอย่างน้อยหนึ่งชื่อในแท็ปก่อนหน้า
vi: Vui lòng thêm cánh đồng

# xlabTime
source: time (days)
th: เวลา (วัน)
vi: Thời gian (ngày)

# ylabYield
source: yield (kg/ha)
th: ผลผลิต (กิโลกรัมต่อไร่)
vi: Sản lượng (kg/ha)

# ylabTheta
source: soil water content (ml/cm³)
th: ปริมาณน้ำในดิน (มิลลิลิตรต่อลูกบาศก์เซนติเมตร)
vi: Hàm lượng nước trong đất (ml/cm³)

# unitRGR
source: g/g/d
th: กรัมต่อกรัมต่อวัน

# unitYield
source: kg/ha
th: กิโลกรัมต่อไร่

# unitLAI
source: m²/ha
th: ตารางเมตรต่อไร่

# unitTime
source: d
th: วัน

# parameterNameRGR
source: relative growth rate
th: อัตราการเจริญเติบโตสัมพัทธ์
vi: Tốc độ tăng trưởng tương đối

# parameterNamePotentialYield
source: potential yield
th: ปริมาณผลผลิตที่คาดว่าจะได้รับ
vi: Năng suất tiềm năng

# parameterNameInitialLeafArea
source: initial leaf area
th: พื้นที่ใบเริ่มต้น
vi: Diện tích lá ban đầu

# parameterNameStartingTime
source: starting time
th: เวลาเริ่มต้น
vi: Thời gian bắt đầu

# parameterNameEndingTime
source: ending time
th: เวลาสิ้นสุด
vi: Thời gian kết thúc

# parameterNameFieldCapacity
source: field capacity to be maintained (0 no irrigation)
th: ระดับความชื้นอิ่มตัวที่ต้องควบคุม (ค่าศูนย์ แสดงว่าไม่มีการให้น้ำ)
vi: Độ ẩm tối đa của cánh đồng được duy trì (nếu bằng 0 là không tưới)

# parameterNameDefault
source: unnamed variable
th: ตัวแปรที่ไม่สามารถระบุได้
vi: Biễn không có tên
